const questions = [

{
id:1,
text:"وقتی اشتباه می‌کنم، مسئولیت آن را می‌پذیرم.",
reverse:true,
scale:1
},

{
id:2,
text:"معمولاً دیگران را مقصر مشکلات خود می‌دانم.",
reverse:false,
scale:1
},

{
id:3,
text:"وقتی اشتباه می‌کنم، معمولاً برای آن بهانه می‌آورم.",
reverse:false,
scale:1
},

{
id:4,
text:"از اشتباهاتم درس می‌گیرم.",
reverse:true,
scale:1
},

{
id:5,
text:"احساسات دیگران برایم اهمیت دارد.",
reverse:true,
scale:2
},

{
id:6,
text:"اگر کسی ناراحت باشد، معمولاً متوجه می‌شوم.",
reverse:true,
scale:2
},

{
id:7,
text:"وقتی اطرافیانم دچار مشکل می‌شوند، معمولاً احساس نمی‌کنم لازم است به آنها کمک کنم.",
reverse:false,
scale:2
},

{
id:8,
text:"بیشتر به خواسته‌های خودم فکر می‌کنم تا احساس دیگران.",
reverse:false,
scale:2
},

{
id:9,
text:"دوست دارم همه چیز طبق نظر من پیش برود.",
reverse:false,
scale:3
},

{
id:10,
text:"اصرار می‌کنم دیگران مطابق نظر من رفتار کنند.",
reverse:false,
scale:3
},

{
id:11,
text:"به دیگران اجازه می‌دهم آزادانه تصمیم بگیرند.",
reverse:true,
scale:3
},

{
id:12,
text:"دوست دارم حرف آخر را من بزنم.",
reverse:false,
scale:3
},

{
id:13,
text:"گاهی با قهر یا سکوت دیگران را تحت فشار قرار می‌دهم.",
reverse:false,
scale:4
},

{
id:14,
text:"برای رسیدن به خواسته‌ام احساس گناه در دیگران ایجاد می‌کنم.",
reverse:false,
scale:4
},

{
id:15,
text:"خواسته‌هایم را صریح و محترمانه بیان می‌کنم.",
reverse:true,
scale:4
},

{
id:16,
text:"گاهی از محبت یا بی‌توجهی برای کنترل دیگران استفاده می‌کنم.",
reverse:false,
scale:4
},

{
id:17,
text:"انتقاد را فرصتی برای رشد می‌دانم.",
reverse:true,
scale:5
},

{
id:18,
text:"با شنیدن انتقاد سریع حالت دفاعی می‌گیرم.",
reverse:false,
scale:5
},

{
id:19,
text:"هنگام انتقاد، بیشتر از آنکه به حرف طرف مقابل فکر کنم، از خودم دفاع می‌کنم.",
reverse:false,
scale:5
},

{
id:20,
text:"پذیرش اشتباه برایم دشوار است.",
reverse:false,
scale:5
},

{
id:21,
text:"به حریم خصوصی دیگران احترام می‌گذارم.",
reverse:true,
scale:6
},

{
id:22,
text:"اصرار می‌کنم دیگران مطابق میل من رفتار کنند.",
reverse:false,
scale:6
},

{
id:23,
text:"اگر کسی به من «نه» بگوید، به تصمیمش احترام می‌گذارم.",
reverse:true,
scale:6
},

{
id:24,
text:"گاهی بدون اجازه در امور دیگران دخالت می‌کنم.",
reverse:false,
scale:6
}

];

const choices = [
"کاملاً مخالفم",
"مخالفم",
"نظری ندارم",
"موافقم",
"کاملاً موافقم"
];